Mat194pl/STM32F7-IEEE1588-2008-implementation/src/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  Ac6
  * @version V1.0
  * @date    01-December-2013
  * @brief   Default main function.
  ******************************************************************************
*/


#include "stm32f7xx.h"
#include "stm32746g_discovery.h"
#include "ethernetif.h"
#include "lcd_log.h"
#include "ptpv2_core.h"
#include "ptpv2_header.h"
#include "ptpv2_message_announce.h"
#include "ptpv2_helper.h"
#include "string.h"

//extern ETH_HandleTypeDef EthHandle;
//extern ETH_DMADescTypeDef  DMARxDscrTab[ETH_RXBUFNB] __attribute__((section(".RxDescripSection")));/* Ethernet Rx MA Descriptor */
//extern ETH_DMADescTypeDef  DMATxDscrTab[ETH_TXBUFNB] __attribute__((section(".TxDescripSection")));


static void SystemClock_Config(void);
static void MPU_Config(void);
static void CPU_CACHE_Enable(void);
static void StartThread(void const * argument);

uint8_t Device_MAC[] = {0, 0, 0, 0, 0, 1};
uint8_t Destination_MAC[] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

int main(void)
{
	/* Configure the MPU attributes as Write Through */
	MPU_Config();

	/* Enable the CPU Cache */
	CPU_CACHE_Enable();

	/* STM32F7xx HAL library initialization:
	       - Configure the Flash ART accelerator on ITCM interface
	       - Configure the Systick to generate an interrupt each 1 msec
	       - Set NVIC Group Priority to 4
	       - Global MSP (MCU Support Package) initialization
	 */
	HAL_Init();

	/* Configure the system clock to 216 MHz */
	SystemClock_Config();


	LCD_LOG_Init();
	LCD_LOG_SetHeader("IEEE-1588 Test");
	LCD_LOG_SetFooter("Debug Console");
	LCD_UsrLog("Start\n\r");
	LCD_LOG_UpdateDisplay();

	ptpv2_time_stamp_t test1;
	ptpv2_time_stamp_t test2;
	test1.sign = 0;
	test2.sign = 0;

	test1.seconds = 0;
	test2.seconds = 0;
	test1.nanoseconds = 2000;
	test2.nanoseconds = 3000;
	ptpv2_time_stamp_t testResult;
	/*testResult = ptpv2_time_stamp_add(test1, test2);
	LOG("%s%u\.%09u + %s%u\.%09u = %s%u\.%09u\n", test1.sign ? "-" : "", test1.seconds, test1.nanoseconds, test2.sign ? "-" : "", test2.seconds, test2.nanoseconds, testResult.sign ? "-" : "", testResult.seconds, testResult.nanoseconds);


	testResult = ptpv2_time_stamp_add(test1, test2);
	LOG("%s%u\.%09u + %s%u\.%09u = %s%u\.%09u\n", test1.sign ? "-" : "", test1.seconds, test1.nanoseconds, test2.sign ? "-" : "", test2.seconds, test2.nanoseconds, testResult.sign ? "-" : "", testResult.seconds, testResult.nanoseconds);
	testResult = ptpv2_time_stamp_sub(test1, test2);
	LOG("%s%u\.%09u - %s%u\.%09u = %s%u\.%09u\n", test1.sign ? "-" : "", test1.seconds, test1.nanoseconds, test2.sign ? "-" : "", test2.seconds, test2.nanoseconds, testResult.sign ? "-" : "", testResult.seconds, testResult.nanoseconds);
	*/testResult = ptpv2_time_stamp_sub(test2, test1);
	//LOG("%s%u\.%09u - %s%u\.%09u = %s%u\.%09u\n", test2.sign ? "-" : "", test2.seconds, test2.nanoseconds, test1.sign ? "-" : "", test1.seconds, test1.nanoseconds, testResult.sign ? "-" : "", testResult.seconds, testResult.nanoseconds);


	osThreadDef(Start, StartThread, osPriorityNormal, 0, configMINIMAL_STACK_SIZE * 5);
	osThreadCreate (osThread(Start), NULL);

	/* Start scheduler */
	osKernelStart();
	for(;;);
}

extern volatile uint8_t isMaster;

static void StartThread(void const * argument)
{
	ethernetif_init();
	if (isMaster)
		LCD_LOG_SetHeader("IEEE-1588 Master");
	else
		LCD_LOG_SetHeader("IEEE-1588 Slave");
	uint32_t PreviousWakeTime = osKernelSysTick();
	for( ;; )
	{
		ptpv2_thread(10);
		//osDelay(20);
		osDelayUntil(&PreviousWakeTime, 10);
	}
}

/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow :
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 216000000
  *            HCLK(Hz)                       = 216000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 4
  *            APB2 Prescaler                 = 2
  *            HSE Frequency(Hz)              = 25000000
  *            PLL_M                          = 25
  *            PLL_N                          = 432
  *            PLL_P                          = 2
  *            PLL_Q                          = 9
  *            VDD(V)                         = 3.3
  *            Main regulator output voltage  = Scale1 mode
  *            Flash Latency(WS)              = 7
  * @param  None
  * @retval None
  */
static void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;
  HAL_StatusTypeDef ret = HAL_OK;

  /* Enable HSE Oscillator and activate PLL with HSE as source */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 12;//25;
  RCC_OscInitStruct.PLL.PLLN = 192;//432;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 9;

  ret = HAL_RCC_OscConfig(&RCC_OscInitStruct);
  if(ret != HAL_OK)
  {
    while(1) { ; }
  }

  /* Activate the OverDrive to reach the 216 MHz Frequency */
  ret = HAL_PWREx_EnableOverDrive();
  if(ret != HAL_OK)
  {
    while(1) { ; }
  }

  /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 clocks dividers */
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  ret = HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_7);
  if(ret != HAL_OK)
  {
    while(1) { ; }
  }
}

/**
  * @brief  Configure the MPU attributes as Write Through for SRAM1/2.
  * @note   The Base Address is 0x20010000 since this memory interface is the AXI.
  *         The Region Size is 256KB, it is related to SRAM1 and SRAM2  memory size.
  * @param  None
  * @retval None
  */
static void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct;

  /* Disable the MPU */
  HAL_MPU_Disable();

  /* Configure the MPU attributes as WT for SRAM */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.BaseAddress = 0x20010000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_256KB;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.SubRegionDisable = 0x00;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /* Enable the MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
}

/**
  * @brief  CPU L1-Cache enable.
  * @param  None
  * @retval None
  */
static void CPU_CACHE_Enable(void)
{
  /* Enable I-Cache */
  SCB_EnableICache();

  /* Enable D-Cache */
  SCB_EnableDCache();
}

